## Data Input and Output

In [2]:
import numpy as np
import pandas as pd

## CSV
#### CSV Input

In [3]:
data = { 'a': [0, 4, 8, 12],
        'b': [1, 5, 9, 13],
        'c': [2, 6, 10, 14],
        'd': [3, 7, 11, 15]}
df = pd.DataFrame(data)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df.to_csv('example.csv', index=False)

In [5]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### CSV Output

In [6]:
df.to_csv('example.csv', index=False)

## Excel

#### Excel Input

In [7]:
pd.read_excel('Excel_sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
# Sample data
data = {'a': [0, 4, 8, 12],
        'b': [1, 5, 9, 13],
        'c': [2, 6, 10, 14],
        'd': [3, 7, 11, 15]}

# Create DataFrame
df = pd.DataFrame(data)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\digidxdoc\digidxdoc\python\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\digidxdoc\digidxdoc\python\.venv\lib\site-packages (from openpyxl) (2.0.0)

In [10]:
# Save to Excel
df.to_excel('Excel_sample.xlsx', sheet_name='Sheet1', index=False)

In [11]:
pd.read_excel('Excel_sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Excel Output

In [12]:
df.to_excel('Excel_sample.xlsx', sheet_name='Sheet1')

## HTML

Install  htmllib5, lxml and BeautifulSoup4.

In [ ]:
pip install lxml
pip install html5lib
pip install BeautifulSoup4

Collecting BeautifulSoup4
  Downloading beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from BeautifulSoup4)
  Downloading soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)
Collecting typing-extensions>=4.0.0 (from BeautifulSoup4)
  Using cached typing_extensions-4.13.2-py3-none-any.whl.metadata (3.0 kB)
Downloading beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)
Downloading soupsieve-2.7-py3-none-any.whl (36 kB)
Using cached typing_extensions-4.13.2-py3-none-any.whl (45 kB)
Installing collected packages: typing-extensions, soupsieve, BeautifulSoup4

   ------------- -------------------------- 1/3 [soupsieve]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   -------------------------- ------------- 2/3 [BeautifulSoup4]
   ---------------------------------------- 3/3 [BeautifulSoup4]

Successfully installed BeautifulSoup4-4.13.4 soupsieve-2.7 typing-extensions-4.13.2
Note: you may need to restart the kernel to use updated packages.

Pandas can read table tabs off of html. For example :

#### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [4]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537